KOBUMANZI TRISHIA

In [8]:
import pandas as pd

In [9]:
Sales=pd.read_csv ("sales_data.csv")
Sales

   Order_ID Customer_Name     Product  Quantity  Sale_Amount        Date
0       101    John Smith      Laptop       1.0       1000.0  2023-01-15
1       102    john SMITH      Tablet       2.0          NaN  15/01/2023
2       103  Mary Johnson       Phone       NaN        800.0  2023-01-16
3       104  Sarah Connor      LAPTOP       1.0       1200.0  2023-01-17
4       105  Sarah Connor      Laptop       1.0       1200.0  2023-01-17
5       106  Peter Parker  Headphones       3.0        300.0  2023/01/18
6       107           NaN      Laptop       1.0       1100.0  2023-01-19
7       108   Bruce Wayne         NaN       2.0        500.0  2023-01-20
8       102    john SMITH      Tablet       2.0          NaN  15/01/2023

In [10]:
#Removing missing values
dropresult = Sales.dropna()
print(dropresult)

   Order_ID Customer_Name     Product  Quantity  Sale_Amount        Date
0       101    John Smith      Laptop       1.0       1000.0  2023-01-15
3       104  Sarah Connor      LAPTOP       1.0       1200.0  2023-01-17
4       105  Sarah Connor      Laptop       1.0       1200.0  2023-01-17
5       106  Peter Parker  Headphones       3.0        300.0  2023/01/18